huming2207/soul-injector/sdkconfig.defaults.esp32s3
# ESP32-S3 defaults used by Soul Injector Rev 3, Rev 5, and Rev 6.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
